В рамках карьерного марафона университета мы посетили выставку индустриальных партнёров, мастер-классы, что позволило установить ценные профессиональные контакты и углубить понимание применения ИТ в различных отраслях. На мастер-классе НИИ «Мостранспроект» были рассмотрены технологии цифрового моделирования, ИИ и ГИС в сфере транспортной инфраструктуры. Кроме этогго, приняли участие в конференции R-EVOLUTION 2025 от компании R-Vision. 
Это дало представление о роли нейросетей в автоматизации кибербезопасности — от работы SOC и SOAR до анализа уязвимостей. Полученные знания напрямую соотносятся с нашими интересами в области нейросетей и ИИ. Участие в мероприятиях стало ценным этапом профессионального развития и помогло лучше понять требования работодателей к молодым специалистам.

![План работ](/images/qwerty12.png)
## ✅ Посещение выставки индустриальных партнёров

![План работ](/images/qw1.jpg)
